darren-you/esp-mqtt/examples/broker-client/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MQTT_PROTOCOL_5=n
CONFIG_MQTT_TRANSPORT_SSL=y
CONFIG_MQTT_REPORT_DELETED_MESSAGES=y
CONFIG_MBEDTLS_HAVE_TIME_DATE=y
CONFIG_ESP_PHY_CALIBRATION_AND_DATA_STORAGE=n
